# NoSolutionInView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..NoSolutionInView Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
There is no solution for this view. All the elements have been filtered for this view, select another view, and select solutions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoSolutionInView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoSolutionInView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoSolutionInView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace